Pregaine/WV08048ERN070G/library/HT32F12365_66_Driver/inc/ht32f12365_66_gptm.h
void GPTM_OutputModeConfig(HT_GPTM_TypeDef* GPTMx, GPTM_CH_Enum Channel, GPTM_OM_Enum Mod);
void GPTM_UpdateCmd(HT_GPTM_TypeDef* GPTMx, ControlStatus NewState);
void GPTM_UEVG_IntConfig(HT_GPTM_TypeDef* GPTMx, ControlStatus NewState);
void GPTM_HallInterfaceCmd(HT_GPTM_TypeDef* GPTMx, ControlStatus NewState);
void GPTM_SinglePulseModeCmd(HT_GPTM_TypeDef* GPTMx, ControlStatus NewState);
void GPTM_MMSELConfig(HT_GPTM_TypeDef* GPTMx, GPTM_MMSEL_Enum Sel);
void GPTM_SlaveModeConfig(HT_GPTM_TypeDef* GPTMx, GPTM_SMSEL_Enum Sel);
void GPTM_TimSyncCmd(HT_GPTM_TypeDef* GPTMx, ControlStatus NewState);
void GPTM_SetCounter(HT_GPTM_TypeDef* GPTMx, u16 Counter);
void GPTM_SetCounterReload(HT_GPTM_TypeDef* GPTMx, u16 Reload);
void GPTM_SetCaptureCompare0(HT_GPTM_TypeDef* GPTMx, u16 Cmp);
void GPTM_SetCaptureCompare1(HT_GPTM_TypeDef* GPTMx, u16 Cmp);
void GPTM_SetCaptureCompare2(HT_GPTM_TypeDef* GPTMx, u16 Cmp);
void GPTM_SetCaptureCompare3(HT_GPTM_TypeDef* GPTMx, u16 Cmp);

void GPTM_SetAsymmetricCompare0(HT_GPTM_TypeDef* GPTMx, u16 Cmp);
void GPTM_SetAsymmetricCompare1(HT_GPTM_TypeDef* GPTMx, u16 Cmp);
void GPTM_SetAsymmetricCompare2(HT_GPTM_TypeDef* GPTMx, u16 Cmp);
void GPTM_SetAsymmetricCompare3(HT_GPTM_TypeDef* GPTMx, u16 Cmp);

void GPTM_CHPSCConfig(HT_GPTM_TypeDef* GPTMx, GPTM_CH_Enum Channel, GPTM_CHPSC_Enum Psc);
void GPTM_CKDIVConfig(HT_GPTM_TypeDef* GPTMx, GPTM_CKDIV_Enum Div);
u32 GPTM_GetCaptureCompare0(HT_GPTM_TypeDef* GPTMx);
u32 GPTM_GetCaptureCompare1(HT_GPTM_TypeDef* GPTMx);
u32 GPTM_GetCaptureCompare2(HT_GPTM_TypeDef* GPTMx);
u32 GPTM_GetCaptureCompare3(HT_GPTM_TypeDef* GPTMx);
u32 GPTM_GetCounter(HT_GPTM_TypeDef* GPTMx);
u32 GPTM_GetPrescaler(HT_GPTM_TypeDef* GPTMx);
void GPTM_GenerateEvent(HT_GPTM_TypeDef* GPTMx, u32 GPTM_EVENT);
FlagStatus GPTM_GetFlagStatus(HT_GPTM_TypeDef* GPTMx, u32 GPTM_FLAG);
void GPTM_ClearFlag(HT_GPTM_TypeDef* GPTMx, u32 GPTM_FLAG);
void GPTM_IntConfig(HT_GPTM_TypeDef* GPTMx, u32 GPTM_INT, ControlStatus NewState);
FlagStatus GPTM_GetIntStatus(HT_GPTM_TypeDef* GPTMx, u32 GPTM_INT);
void GPTM_ClearIntPendingBit(HT_GPTM_TypeDef* GPTMx, u32 GPTM_INT);
void GPTM_InternalClockConfig(HT_GPTM_TypeDef* GPTMx);

void GPTM_CHCCDSConfig(HT_GPTM_TypeDef* GPTMx, GPTM_CHCCDS_Enum Selection);
void GPTM_PDMAConfig(HT_GPTM_TypeDef* GPTMx, u32 GPTM_PDMA, ControlStatus NewState);
/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif
